---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RoofAttrDefaultThicknessParam
source: html/a986a84a-d307-07e8-bfd3-d5aafbb7e294.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RoofAttrDefaultThicknessParam Property

"Default Thickness"

## Syntax (C#)
```csharp
public static ForgeTypeId RoofAttrDefaultThicknessParam { get; }
```